Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.5.53/edc/ATSAMD10D13AS.PIC
      <edc:SFRDef edc:_addr="0x41007090" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS2PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41007094" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS2PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41007098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS3PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100709C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS3PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410070A0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS4PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:desc="Master 0 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:desc="Master 1 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:desc="Master 2 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:desc="Master 3 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:desc="Master 4 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:desc="Master 5 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:desc="Master 6 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:desc="Master 7 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410070A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS4PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SBMATRIX">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:desc="Master 8 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:desc="Master 9 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:desc="Master 10 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:desc="Master 11 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:desc="Master 12 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:desc="Master 13 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:desc="Master 14 Priority" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:desc="Master 15 Priority" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
